# Read CSV Data

In [1]:
import pandas as pd
read1=pd.read_csv("./csv1.csv")
print(read1)

   JE Code             Store       Country        Date             Item  \
0   I-1001            Moscow        Russia   10/6/2018        Microwave
1   I-1002           Toronto        Canada   4/23/2015        Microwave
2   I-1003         Sao Paolo        Brazil    4/3/2017  Air conditioner
3   I-1004          Istanbul        Turkey   8/14/2018      Ceiling fan
4   I-1005            Sydney     Australia    3/3/2015          Toaster
5   I-1006          Shenzhen         China   4/25/2016             Iron
6   I-1007              Lima          Peru    6/6/2016       Dishwasher
7   I-1008           Tijuana        Mexico    6/7/2016             Iron
8   I-1009            London            UK  12/11/2015  Washing Machine
9   I-1010              Lima          Peru    9/7/2014             Iron
10  I-1011            Riyadh  Saudi Arabia   10/7/2017     Refrigerator
11  I-1012           Bangkok      Thailand   8/21/2014  Air conditioner
12  I-1013           Tijuana        Mexico    3/9/2015             Iron
13  I-1014             Delhi         India   5/30/2014             Oven
14  I-1015            Sydney     Australia  11/12/2018  Washing Machine
15  I-1016  Ho Chi Minh City       Vietnam   5/24/2015        Microwave
16  I-1017          Tel Aviv        Israel   12/6/2014     Refrigerator

    List Price
0           80
1           80
2          700
3          150
4           50
5           30
6          500
7           30
8          800
9           30
10        1000
11         700
12          30
13         500
14         800
15          80
16        1000

In [2]:
read1.index

RangeIndex(start=0, stop=17, step=1)

In [3]:
read1.columns

Index(['JE Code', 'Store', 'Country', 'Date', 'Item', 'List Price'], dtype='object')

In [4]:
read1.describe()

        List Price
count    17.000000
mean    385.882353
std     377.194559
min      30.000000
25%      50.000000
50%     150.000000
75%     700.000000
max    1000.000000

In [5]:
read1.head()

  JE Code      Store    Country       Date             Item  List Price
0  I-1001     Moscow     Russia  10/6/2018        Microwave          80
1  I-1002    Toronto     Canada  4/23/2015        Microwave          80
2  I-1003  Sao Paolo     Brazil   4/3/2017  Air conditioner         700
3  I-1004   Istanbul     Turkey  8/14/2018      Ceiling fan         150
4  I-1005     Sydney  Australia   3/3/2015          Toaster          50

In [6]:
read1.head(2)

  JE Code    Store Country       Date       Item  List Price
0  I-1001   Moscow  Russia  10/6/2018  Microwave          80
1  I-1002  Toronto  Canada  4/23/2015  Microwave          80

In [7]:
read1.tail(2)

   JE Code             Store  Country       Date          Item  List Price
15  I-1016  Ho Chi Minh City  Vietnam  5/24/2015     Microwave          80
16  I-1017          Tel Aviv   Israel  12/6/2014  Refrigerator        1000

In [8]:
read1.tail()

,JE Code,Store,Country,Date,Item,List Price
12,I-1013,Tijuana,Mexico,3/9/2015,Iron,30
13,I-1014,Delhi,India,5/30/2014,Oven,500
14,I-1015,Sydney,Australia,11/12/2018,Washing Machine,800
15,I-1016,Ho Chi Minh City,Vietnam,5/24/2015,Microwave,80
16,I-1017,Tel Aviv,Israel,12/6/2014,Refrigerator,1000

In [9]:
read1[5:11]

   JE Code     Store       Country        Date             Item  List Price
5   I-1006  Shenzhen         China   4/25/2016             Iron          30
6   I-1007      Lima          Peru    6/6/2016       Dishwasher         500
7   I-1008   Tijuana        Mexico    6/7/2016             Iron          30
8   I-1009    London            UK  12/11/2015  Washing Machine         800
9   I-1010      Lima          Peru    9/7/2014             Iron          30
10  I-1011    Riyadh  Saudi Arabia   10/7/2017     Refrigerator        1000

In [10]:
read1.index.array

<NumpyExtensionArray>
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
Length: 17, dtype: int64

In [11]:
read1.to_numpy()

array([['I-1001', 'Moscow', 'Russia', '10/6/2018', 'Microwave', 80],
       ['I-1002', 'Toronto', 'Canada', '4/23/2015', 'Microwave', 80],
       ['I-1003', 'Sao Paolo', 'Brazil', '4/3/2017', 'Air conditioner',
        700],
       ['I-1004', 'Istanbul', 'Turkey', '8/14/2018', 'Ceiling fan', 150],
       ['I-1005', 'Sydney', 'Australia', '3/3/2015', 'Toaster', 50],
       ['I-1006', 'Shenzhen', 'China', '4/25/2016', 'Iron', 30],
       ['I-1007', 'Lima', 'Peru', '6/6/2016', 'Dishwasher', 500],
       ['I-1008', 'Tijuana', 'Mexico', '6/7/2016', 'Iron', 30],
       ['I-1009', 'London', 'UK', '12/11/2015', 'Washing Machine', 800],
       ['I-1010', 'Lima', 'Peru', '9/7/2014', 'Iron', 30],
       ['I-1011', 'Riyadh', 'Saudi Arabia', '10/7/2017', 'Refrigerator',
        1000],
       ['I-1012', 'Bangkok', 'Thailand', '8/21/2014', 'Air conditioner',
        700],
       ['I-1013', 'Tijuana', 'Mexico', '3/9/2015', 'Iron', 30],
       ['I-1014', 'Delhi', 'India', '5/30/2014', 'Oven', 500],
       ['I-1015', 'Sydney', 'Australia', '11/12/2018', 'Washing Machine',
        800],
       ['I-1016', 'Ho Chi Minh City', 'Vietnam', '5/24/2015',
        'Microwave', 80],
       ['I-1017', 'Tel Aviv', 'Israel', '12/6/2014', 'Refrigerator',
        1000]], dtype=object)

In [12]:
import numpy as np
v=np.asarray(read1)
v

array([['I-1001', 'Moscow', 'Russia', '10/6/2018', 'Microwave', 80],
       ['I-1002', 'Toronto', 'Canada', '4/23/2015', 'Microwave', 80],
       ['I-1003', 'Sao Paolo', 'Brazil', '4/3/2017', 'Air conditioner',
        700],
       ['I-1004', 'Istanbul', 'Turkey', '8/14/2018', 'Ceiling fan', 150],
       ['I-1005', 'Sydney', 'Australia', '3/3/2015', 'Toaster', 50],
       ['I-1006', 'Shenzhen', 'China', '4/25/2016', 'Iron', 30],
       ['I-1007', 'Lima', 'Peru', '6/6/2016', 'Dishwasher', 500],
       ['I-1008', 'Tijuana', 'Mexico', '6/7/2016', 'Iron', 30],
       ['I-1009', 'London', 'UK', '12/11/2015', 'Washing Machine', 800],
       ['I-1010', 'Lima', 'Peru', '9/7/2014', 'Iron', 30],
       ['I-1011', 'Riyadh', 'Saudi Arabia', '10/7/2017', 'Refrigerator',
        1000],
       ['I-1012', 'Bangkok', 'Thailand', '8/21/2014', 'Air conditioner',
        700],
       ['I-1013', 'Tijuana', 'Mexico', '3/9/2015', 'Iron', 30],
       ['I-1014', 'Delhi', 'India', '5/30/2014', 'Oven', 500],
       ['I-1015', 'Sydney', 'Australia', '11/12/2018', 'Washing Machine',
        800],
       ['I-1016', 'Ho Chi Minh City', 'Vietnam', '5/24/2015',
        'Microwave', 80],
       ['I-1017', 'Tel Aviv', 'Israel', '12/6/2014', 'Refrigerator',
        1000]], dtype=object)

In [13]:
read1.sort_index(axis=0,ascending=False)

,JE Code,Store,Country,Date,Item,List Price
16,I-1017,Tel Aviv,Israel,12/6/2014,Refrigerator,1000
15,I-1016,Ho Chi Minh City,Vietnam,5/24/2015,Microwave,80
14,I-1015,Sydney,Australia,11/12/2018,Washing Machine,800
13,I-1014,Delhi,India,5/30/2014,Oven,500
12,I-1013,Tijuana,Mexico,3/9/2015,Iron,30
11,I-1012,Bangkok,Thailand,8/21/2014,Air conditioner,700
10,I-1011,Riyadh,Saudi Arabia,10/7/2017,Refrigerator,1000
9,I-1010,Lima,Peru,9/7/2014,Iron,30
8,I-1009,London,UK,12/11/2015,Washing Machine,800
7,I-1008,Tijuana,Mexico,6/7/2016,Iron,30
6,I-1007,Lima,Peru,6/6/2016,Dishwasher,500
5,I-1006,Shenzhen,China,4/25/2016,Iron,30
4,I-1005,Sydney,Australia,3/3/2015,Toaster,50
3,I-1004,Istanbul,Turkey,8/14/2018,Ceiling fan,150
2,I-1003,Sao Paolo,Brazil,4/3/2017,Air conditioner,700
1,I-1002,Toronto,Canada,4/23/2015,Microwave,80
0,I-1001,Moscow,Russia,10/6/2018,Microwave,80

In [14]:
read1["Store"][1]="Sumit"
read1

C:\Users\pc\AppData\Local\Temp\ipykernel_19628\2551433719.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read1["Store"][1]="Sumit"
C:\Users\pc\AppData\Local\Temp\ipykernel_19628\2551433719.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read1["Store"][1]="Sumit"

,JE Code,Store,Country,Date,Item,List Price
0,I-1001,Moscow,Russia,10/6/2018,Microwave,80
1,I-1002,Sumit,Canada,4/23/2015,Microwave,80
2,I-1003,Sao Paolo,Brazil,4/3/2017,Air conditioner,700
3,I-1004,Istanbul,Turkey,8/14/2018,Ceiling fan,150
4,I-1005,Sydney,Australia,3/3/2015,Toaster,50
5,I-1006,Shenzhen,China,4/25/2016,Iron,30
6,I-1007,Lima,Peru,6/6/2016,Dishwasher,500
7,I-1008,Tijuana,Mexico,6/7/2016,Iron,30
8,I-1009,London,UK,12/11/2015,Washing Machine,800
9,I-1010,Lima,Peru,9/7/2014,Iron,30
10,I-1011,Riyadh,Saudi Arabia,10/7/2017,Refrigerator,1000
11,I-1012,Bangkok,Thailand,8/21/2014,Air conditioner,700
12,I-1013,Tijuana,Mexico,3/9/2015,Iron,30
13,I-1014,Delhi,India,5/30/2014,Oven,500
14,I-1015,Sydney,Australia,11/12/2018,Washing Machine,800
15,I-1016,Ho Chi Minh City,Vietnam,5/24/2015,Microwave,80
16,I-1017,Tel Aviv,Israel,12/6/2014,Refrigerator,1000

In [15]:
read1.loc[1,"Store"]="Rohan"
read1

,JE Code,Store,Country,Date,Item,List Price
0,I-1001,Moscow,Russia,10/6/2018,Microwave,80
1,I-1002,Rohan,Canada,4/23/2015,Microwave,80
2,I-1003,Sao Paolo,Brazil,4/3/2017,Air conditioner,700
3,I-1004,Istanbul,Turkey,8/14/2018,Ceiling fan,150
4,I-1005,Sydney,Australia,3/3/2015,Toaster,50
5,I-1006,Shenzhen,China,4/25/2016,Iron,30
6,I-1007,Lima,Peru,6/6/2016,Dishwasher,500
7,I-1008,Tijuana,Mexico,6/7/2016,Iron,30
8,I-1009,London,UK,12/11/2015,Washing Machine,800
9,I-1010,Lima,Peru,9/7/2014,Iron,30
10,I-1011,Riyadh,Saudi Arabia,10/7/2017,Refrigerator,1000
11,I-1012,Bangkok,Thailand,8/21/2014,Air conditioner,700
12,I-1013,Tijuana,Mexico,3/9/2015,Iron,30
13,I-1014,Delhi,India,5/30/2014,Oven,500
14,I-1015,Sydney,Australia,11/12/2018,Washing Machine,800
15,I-1016,Ho Chi Minh City,Vietnam,5/24/2015,Microwave,80
16,I-1017,Tel Aviv,Israel,12/6/2014,Refrigerator,1000

In [16]:
read1.loc[[2,3],["Store","Country"]]

       Store Country
2  Sao Paolo  Brazil
3   Istanbul  Turkey

In [17]:
read1.loc[[2,3],:]

  JE Code      Store Country       Date             Item  List Price
2  I-1003  Sao Paolo  Brazil   4/3/2017  Air conditioner         700
3  I-1004   Istanbul  Turkey  8/14/2018      Ceiling fan         150

In [18]:
read1.iloc[0,1]

'Moscow'

In [19]:
read1.drop("Store",axis=1)

   JE Code       Country        Date             Item  List Price
0   I-1001        Russia   10/6/2018        Microwave          80
1   I-1002        Canada   4/23/2015        Microwave          80
2   I-1003        Brazil    4/3/2017  Air conditioner         700
3   I-1004        Turkey   8/14/2018      Ceiling fan         150
4   I-1005     Australia    3/3/2015          Toaster          50
5   I-1006         China   4/25/2016             Iron          30
6   I-1007          Peru    6/6/2016       Dishwasher         500
7   I-1008        Mexico    6/7/2016             Iron          30
8   I-1009            UK  12/11/2015  Washing Machine         800
9   I-1010          Peru    9/7/2014             Iron          30
10  I-1011  Saudi Arabia   10/7/2017     Refrigerator        1000
11  I-1012      Thailand   8/21/2014  Air conditioner         700
12  I-1013        Mexico    3/9/2015             Iron          30
13  I-1014         India   5/30/2014             Oven         500
14  I-1015     Australia  11/12/2018  Washing Machine         800
15  I-1016       Vietnam   5/24/2015        Microwave          80
16  I-1017        Israel   12/6/2014     Refrigerator        1000